rss.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-04 Sun 15:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matúš Goljer" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./sitemap.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content">
<div id="outline-container-orgdc04f68" class="outline-2">
<h2 id="orgdc04f68"><a id="ID-85b9115c-2451-472a-aac1-6fb7b0618892"></a>The absolute awesomeness of anchored font-lock matchers</h2>
<div class="outline-text-2" id="text-orgdc04f68">
</div>
</div>

<div id="outline-container-org60af5cf" class="outline-2">
<h2 id="org60af5cf"><a id="ID-a3ff923f-c4ad-40bf-bc9e-487d219f4a6a"></a>Generating all groupings of (1|2)* summing up to m</h2>
<div class="outline-text-2" id="text-org60af5cf">
</div>
</div>

<div id="outline-container-org56d7e0b" class="outline-2">
<h2 id="org56d7e0b"><a id="ID-25bf3e1a-496d-4c01-ba66-9e172f358a0c"></a>Fontify done checkbox items in org-mode</h2>
<div class="outline-text-2" id="text-org56d7e0b">
</div>
</div>

<div id="outline-container-org41f97df" class="outline-2">
<h2 id="org41f97df"><a id="ID-985ae261-b93f-4c56-9be3-272913e1bef9"></a>Automatically remove inherited tags from tasks after refiling</h2>
<div class="outline-text-2" id="text-org41f97df">
</div>
</div>

<div id="outline-container-orgee53bc9" class="outline-2">
<h2 id="orgee53bc9"><a id="ID-3e968035-a32c-48b6-a941-d5da946ea4c0"></a>Enhanced beginning- and end-of-buffer in special mode buffers (dired etc.)</h2>
<div class="outline-text-2" id="text-orgee53bc9">
</div>
</div>

<div id="outline-container-org81f0afe" class="outline-2">
<h2 id="org81f0afe"><a id="ID-89aad8b2-c98a-44cf-b357-4b0e0844d91b"></a>WAR STORY: Prevent point jumping around invisible text</h2>
<div class="outline-text-2" id="text-org81f0afe">
</div>
</div>

<div id="outline-container-org11f2e92" class="outline-2">
<h2 id="org11f2e92"><a id="ID-f11735f3-1374-465f-8220-41e6c3ef0688"></a>Support for imenu in dired</h2>
<div class="outline-text-2" id="text-org11f2e92">
</div>
</div>

<div id="outline-container-orgb5a8d13" class="outline-2">
<h2 id="orgb5a8d13"><a id="ID-a7860e30-8de2-4f96-a328-2ef2f56c3b9f"></a>Turn on context-aware modes on shell command output</h2>
<div class="outline-text-2" id="text-orgb5a8d13">
</div>
</div>

<div id="outline-container-org63ea9e1" class="outline-2">
<h2 id="org63ea9e1"><a id="ID-3adaf5d9-dd68-48fc-b179-2875dda72957"></a>Save write-protected files with sudo automatically</h2>
<div class="outline-text-2" id="text-org63ea9e1">
</div>
</div>

<div id="outline-container-org39be5a5" class="outline-2">
<h2 id="org39be5a5"><a id="ID-d96a5fc6-b8b9-4541-b8b3-6b833ad773a2"></a>Archive subtrees under the same hierarchy as original in the archive files</h2>
<div class="outline-text-2" id="text-org39be5a5">
</div>
</div>

<div id="outline-container-org23b5cc1" class="outline-2">
<h2 id="org23b5cc1"><a id="ID-40e05400-3258-4570-82cd-dc4663ca42f7"></a>Annoying prefix argument</h2>
<div class="outline-text-2" id="text-org23b5cc1">
</div>
</div>

<div id="outline-container-org6887e95" class="outline-2">
<h2 id="org6887e95"><a id="ID-4bba9921-04b5-4357-a74d-b085ac747a18"></a>Ablative of comparison vs quam</h2>
<div class="outline-text-2" id="text-org6887e95">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Last updated at: 2017-06-04 15:39</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/rss.org">Edit on GitHub!</a></div>
</div>
</body>
</html>
